tap "chef/chef"
tap "cloudfoundry/tap"
tap "comcast/autobahn", "git@github.comcast.com:Project-Autobahn/homebrew-autobahn.git"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "neovim/neovim"
brew "openssl@1.1"
brew "readline"
brew "xz"
brew "python@3.11"
brew "docutils"
brew "awscli"
brew "awscurl"
brew "clang-format"
brew "codespell"
brew "unbound"
brew "gnutls"
brew "libssh"
brew "qemu"
brew "lima"
brew "colima"
brew "coreutils"
brew "ctags"
brew "docker"
brew "docker-compose"
brew "docker-credential-helper"
brew "flake8"
brew "fonttools"
brew "fzf"
brew "grep"
brew "grpcurl"
brew "libtool"
brew "guile"
brew "harfbuzz"
brew "helm"
brew "httpie"
brew "hub"
brew "jq"
brew "krb5"
brew "libssh2"
brew "libraqm"
brew "luajit", args: ["HEAD"]
brew "luv"
brew "marksman"
brew "openjdk"
brew "maven"
brew "neovim"
brew "node"
brew "pick"
brew "tcl-tk"
brew "webp"
brew "pillow"
brew "postgresql@14"
brew "protobuf"
brew "pyenv"
brew "python@3.10"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "rust"
brew "shellcheck"
brew "tcptraceroute"
brew "telnet"
brew "tfenv"
brew "tflint"
brew "tfsec"
brew "tmux"
brew "tree"
brew "vault"
brew "watch"
brew "weasyprint"
brew "wget"
brew "yamllint"
brew "yarn"
brew "yq"
brew "zlib"
brew "cloudfoundry/tap/cf-cli@8"
brew "comcast/autobahn/jump"
brew "hashicorp/tap/terraform-ls"
cask "dbeaver-community"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-iosevka-nerd-font"
cask "keybase"
cask "signal"
