tap "chef/chef"
tap "cloudfoundry/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "neovim/neovim"
brew "openssl@1.1"
brew "readline"
brew "sqlite"
brew "xz"
brew "awscli"
brew "clang-format"
brew "codespell"
brew "libtool"
brew "colima"
brew "ctags"
brew "docker"
brew "docker-compose"
brew "docker-credential-helper"
brew "flake8"
brew "grep"
brew "grpcurl"
brew "helm"
brew "httpie"
brew "hub"
brew "jq"
brew "luajit", args: ["HEAD"]
brew "maven"
brew "neovim"
brew "node"
brew "pick"
brew "postgresql@14"
brew "protobuf"
brew "pyenv"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "rust"
brew "shellcheck"
brew "tcptraceroute"
brew "tfenv"
brew "tflint"
brew "tfsec"
brew "tmux"
brew "tree"
brew "vault"
brew "watch"
brew "wget"
brew "yamllint"
brew "yarn"
brew "yq"
brew "zlib"
brew "cloudfoundry/tap/cf-cli"
brew "comcast/autobahn/jump"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-iosevka-nerd-font"
