tap "felixkratz/formulae"
tap "hashicorp/tap"
tap "nikitabobko/tap"
tap "terraform-linters/tap"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Official Amazon AWS command-line interface
brew "awscli"
# Curl like simplicity to access AWS resources
brew "awscurl"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Fix common misspellings in source code and text files
brew "codespell"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Reimplementation of ctags(1)
brew "ctags"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Platform keystore credential helper for Docker
brew "docker-credential-helper"
# Text processing system for reStructuredText
brew "docutils"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Lint your Python code for style and logical errors
brew "flake8"
# Library for manipulating fonts
brew "fonttools"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Highly customizable changelog generator
brew "git-cliff"
# Prevents you from committing sensitive information to a git repo
brew "git-secrets"
# Open-source GitLab command-line tool
brew "glab"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Like cURL, but for gRPC
brew "grpcurl"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Kubernetes package manager
brew "helm"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Simple terminal UI for git commands
brew "lazygit"
# Powerful, lightweight programming language
brew "lua"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Package manager for the Lua programming language
brew "luarocks"
# Language Server Protocol for Markdown
brew "marksman"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Open source, general-purpose policy engine
brew "opa"
# Drop-in replacement for Terraform. Infrastructure as Code Tool
brew "opentofu"
# Utility to choose one option from a set of choices
brew "pick"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Object-relational database system
brew "postgresql@18", link: true
# Fast Git hook manager written in Rust, drop-in alternative to pre-commit
brew "prek"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Generic machine emulator and virtualizer
brew "qemu"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Change macOS audio source from the command-line
brew "switchaudio-osx"
# Traceroute implementation using TCP packets
brew "tcptraceroute"
# Modernized, complete, self-contained TeX/LaTeX engine
brew "tectonic"
# User interface to the TELNET protocol
brew "telnet"
# Tool to generate documentation from Terraform modules
brew "terraform-docs"
# Terraform Language Server
brew "terraform-ls"
# Static analysis security scanner for your terraform code
brew "tfsec"
# Programmatically correct mistyped console commands
brew "thefuck"
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Convert HTML to PDF
brew "weasyprint"
# Internet file retriever
brew "wget"
# Linter for YAML files
brew "yamllint"
# JavaScript package manager
brew "yarn"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# General-purpose lossless data-compression library
brew "zlib"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Command-line interface for 1Password
cask "1password-cli"
# Application launcher and productivity software
cask "alfred"
cask "font-iosevka-nerd-font"
cask "font-iosevka-term-nerd-font"
cask "font-symbols-only-nerd-font"
# Menu bar manager
cask "jordanbaird-ice"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Pluggable Terraform linter
cask "terraform-linters/tap/tflint"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
vscode "anthropic.claude-code"
vscode "catppuccin.catppuccin-vsc"
vscode "hashicorp.terraform"
npm "@mermaid-js/mermaid-cli"
npm "markdown-toc"
npm "prettier"
